{
    "summary": [
        "b. 1967 Ibi (Alicante)",
        "Lives and works in Menorca/Madrid"
    ],
    "studies": [
        "1987- . Fine Arts studies in the Faculty of Fine Arts of the University of Granada, Spain",
        "1991- . Fine Arts degree with a specialization in Painting from the University of Seville, Spain",
        "2001- . DEA (Diploma of Advanced Studies) Doctorate in Modern Art History from the Complutense University of Madrid as part of the doctoral program in Theory and Practice: Modern and Ancient Age at the Faculty of Art History, Madrid, Spain"
    ],
    "comingsoon": [
        "Next exhibitions coming soon:",
        "2025- . International exhibition “Interconnecting Lines”. New York City, USA",
        "2025- . The Second London Biennale of Women in Art. Chelsea Old Town Hall. London, England"
    ],
    "exhibitions": [
        "2024- . Selected artwork in the “Marina” Collective Exhibition organized by the Spanish Association of Painters and Sculptors. Exhibited at the &quot;Juana Francés” and &quot;Pablo Serrano&quot; Exhibition Halls, Madrid City Council, Spain",
        "2024- . Artwork selected and held in the Museo dell&#39;Orologeria, Collective exhibition “LIMITLESS beyond Time”, Libri d’Artista, Pesariis-Udine, Italy",
        "2024- . Contemporary Art Exhibition “EUNOIA”. Monat Gallery. Madrid, Spain",   
        "2022- . Contemporary Art Exhibition Sessenheim room. Strasbourg, France",
        "2021- . Collective Exhibition La Robertsau. Strasbourg, France",
        "2017- . Contemporary Art Exhibition, In The Garden, Madrid, Spain",
        "2016- . Among Oaks, Pop Up Art Retamas, Madrid, Spain",
        "2015- . Sensations, Art Exhibition, Madrid, Spain",
        "2014- . Pop Up Art Retamas, Madrid, Spain",
        "2013- . Art Exhibition Retiro, Madrid, Spain",
        "2011- . Pop Up Art Retiro, Madrid, Spain",
        "2009- . Collective Exhibition Evoking the Classics, Madrid, Spain",
        "2005- . Contemporary Art Exhibition Retiro, Madrid, Spain",
        "1999- . Unique art exhibition, Malaga, Spain",
        "1997- . The Art Route “El Tardón”, Seville, Spain",
        "1995- . Collective Exhibition Young Painters. Malaga, Spain",
        "1992- . 1st Accesit Prize of The Painting Contest “Casa de Melilla”. Exhibition Centre Malaga, Spain",
        "1992- . XIV Collective Exhibition of “Rondeños” Painters. Exhibition Culture Centre. Ronda, Malaga, Spain",
        "1991- . Exhibition &quot;Accidental Collective&quot;. Centro Municipal de Cultura. Burgos",
        "1991- . Solo exhibition “Untitled”. Cultural Centre. Melilla (Spain)",
        "1991- . Collective exhibition Faculty of Fine Arts “Santa Isabel de Hungría”, Seville, Spain",
        "1991- . Exhibition &quot;Accidental Collective&quot;. Municipal Culture Centre Tordesillas (Valladolid, Spain)",
        "1991- . XIII Collective Exhibition of “Rondeños” Painters. Exhibition Culture Centre. Ronda, Malaga, Spain",
        "1991- . Exhibition &quot;Doce Horas&quot;. Municipal Hall of Culture. Tordesillas Valladolid, Spain",
        "1991- . Exhibition Estopiñán Week. Melilla. Spain",
        "1991- . Exhibition Contest Cultural Center Federico García Lorca. Melilla Spain",
        "1990- . Exhibition Posters III competition University Proclamation EASTER. Seville, Spain",
        "1990- . Exhibition &quot;Accidental Collective&quot;. “Caja Rural” Exhibition Centre. Burgos. Spain.",
        "1990- . Collective exhibition Faculty of Fine Arts “Santa Isabel de Hungría” Seville. Spain.",
        "1990- . Exhibition &quot;Accidental Collective&quot;. Centro Municipal de Cultura. Burgos. Spain.",
        "1990- . Exhibition &quot;Doce Horas&quot;. Centro Municipal de Cultura. Burgos. Spain.",
        "1990- . Exhibition Municipal Cultural Center. Ubrique, Cádiz, Spain.",
        "1990- . Artwork published in the magazine &quot;Entre todos&quot; of the Ronda City Council, Málaga, Spain. No. 17.",
        "1990- . Artwork on the cover of the newspaper &quot;Cuadernos para alfabetizar&quot; School of Adult Education, Ronda, Malaga. Spain.",
        "1989- . Exhibition &quot;Accidental Collective&quot;. Mancha Gallery. Santo Domingo de Silos, Burgos, Spain.",
        "1989- . Exhibition carnival posters. Ronda Malaga, Spain.",
        "1989- . XI Collective Exhibition of “Rondeños” Painters. Culture Centre Ronda Malaga, Spain",
        "1988- . Exhibition posters of Easter. Toledo. Spain.",
        "1988- . X Collective Exhibition of Rondeños Painters. Hall Exhibitions Culture Centre. Ronda. Malaga, Spain.",
        "1987- . IX Collective Exhibition of Rondeños Painters. Culture Centre. Ronda. Malaga, Spain.",
        "1987- . Collective exhibition Faculty of Fine Arts. Granada. Spain.",
        "1985- . VII Collective Exhibition of Rondeños Painters. Culture Centre. Ronda, Malaga, Spain"
    ],
    "collections": [
        "Museo dell'Orologeria Pesariis-Udine, Italy",
        "O. Schlepp collection, The Vosges, Heiligenberg and Strasbourg, France"
    ]
} 